<template>
	<AppHeader />

	<main class="main-block bg-primary">
		<h1 class="text-4xl">Информация о программе</h1>

		<p class="mt-4 text-xl">
			Данная программа была разработана в рамках курсовой работы студента БГУИР факультета
			компьютерного проектирования группы 410972 <b>Лозюка Виталия Александровича</b>.
		</p>

		<p class="mt-4 text-xl">
			Данная программа представляет собой средство проверки скорости печати. В ней вы можете
			проходить тесты на скорость печати в двух формах: за одну минуту и до конца текста. Если
			у вас есть аккаунт, весь ваш прогресс будет сохраняться, чтобы вы могли отслеживать ваше
			развитие в скорости набора текста. Также вы сможете создавать собственные тексты и
			тренироваться на них.
		</p>

		<p class="mt-4 text-xl">
			Если вы забыли пароль от аккаунта, вы можете попробовать восстановить его, используя
			вашу почту. По всем остальным вопросам можете писать на
			<a href="mailto:vitalik050405@gmail.com" class="text-orange-400" target="_blank">
				почту разработчика (vitalik050405@gmail.com).
			</a>
		</p>
	</main>
</template>

<script setup>
import AppHeader from '@/components/base/AppHeader.vue'
</script>
